# # 1.1. Распаковка последовательности в отдельные переменные
# Задача
# У вас есть кортеж из N элементов или последовательность, которую вы хотите распаковать в коллекцию из N переменных
#  --------------------------------------------
#
# p = (4, 5)
# x, y = p
# print(x)
# print(y)
#  --------------------------------------------
# data = ['ACME', 50, 90.1, (2012, 12, 21)]
# name, shares, price, date = data
# print(name)
# print(date)
#  --------------------------------------------
# s = 'Hello'
# a, b, c, d, e = s
# print(a)
# print(d)
#  --------------------------------------------
# data = ['ACME', 50, 90.1, (2012, 12, 21)]
# _, shares, price, _ = data
# print(shares)
# print(price)


